Repository: deepin-community/module-assistant
Catalog: po/*.po
Languages: de

source: Warning: the selected module source is known to require a complete kernel source structure in order to be built correctly. However, only a reduced version of the source (linux-headers) has been found, so the build process will probably fail. In order to get a full kernel source, you have the following options: - fake the source directory - create one that may look very similar to the one that has been used to build your kernel (based on its configuration and fresh source archive). The results are uncertain, but it should work in most cases. Call "module-assistant fakesource" to automate this. - use a custom kernel built from scratch (custom configuration, custom source, custom kernel package installed). Please read the Kernel HOWTO and/or make-kpkg documentation for the further steps.
de: Warnung: für das gewählten Modul-Paket wird voraussichtlich ein kompletter Quellcode-Baum des Kernel benötigt, um fehlerfrei zu kompilieren. Es wurde jedoch nur eine reduzierte Version dieses Kernel-Quellcodes gefunden (linux-headers). Der Bau wird mit großer Wahrscheinlichkeit fehlschlagen. Um den kompletten Kernel-Quellcode zu erhalten, haben Sie u.a. folgende Optionen: - den ursprünglichen Quellcode-Baum dieses Kernels rekonstruieren, ausgehend von der bekannten Konfiguration und einer frischen Kopie des Kernel- Quellcodes . Das Ergebnis muss nicht funktionieren, tut es in der Praxis aber meistens. Diese Operation kann mit module-assistant mit dem Befehl "module-assistant fakesource" durchgeführt werden. - einen eigenen Kernel verwenden (selbst gebaut, mit eigener Konfiguration, ggf. als lokales Kernel-Paket installiert ). Für weitere Informationen lesen Sie bitte das Kernel-Howto und/oder die Dokumentation von make-kpkg.

source: module-assistant, error message
de: module-assistant, Fehlermeldung

source: Press Return to continue... (ctrl-c to abort)
de: Zum Weitermachen Return drücken, Strg-C zum Abbrechen.

source: %s is not a directory!
de: %s ist kein Verzeichnis!

source: %s is not writeable!
de: %s ist nicht beschreibbar!

source: Found sudo, will use it for %s and dpkg commands.
de: Sudo wurde gefunden, wird für %s- und dpkg-Aufrufe verwendet.

source: Warning: sudo not found. Automatic package installations not possible!
de: Warnung: sudo nicht gefunden. Automatische Paketinstallationen nicht möglich!

source: Bad luck, the kernel headers for the target kernel version could not be found and you did not specify other valid kernel headers to use.
de: Pech gehabt, es wurden keine zum aktuellen Kernel passende Headers gefunden und es wurden keine weiteren Kernel-Verzeichnisse angegeben.

source: However, you can install the header files for your kernel which are provided by the %s package. For most modules packages, these files are perfectly sufficient without having the original kernel source. To install the package, run
de: Sie können jedoch die Header-Dateien installieren, die vielleicht im Paket %s ausgeliefert werden. Für die meisten Modul-Pakete ist das vollkommen ausreichend, ohne den gesamten Kernel-Quellcode zu haben. Um das Paket zu installieren, führen Sie die Funktion

source: the PREPARE command from the main menu, or on the command line
de: PREPARE aus dem Haupt-Menü aus, oder von der Kommandozeile mit:

source: : module-assistant prepare or %s install %s
de: : module-assistant prepare oder %s install %s

source: If the running kernel has been shipped with the Debian distribution, please install the package %s. If your kernel source tree (or headers) is located in some non-usual location, please set the KERNELDIRS environment variable to the path of this directory, or (alternatively) specify the source directory we build for with the --kernel-dir option in module-assistant calls.
de: Wenn der zur Zeit laufende Kernel mit der Debian Distribution ausgeliefert wurde, installieren Sie bitte das Paket %s. Wenn ihr Kernel-Quellcode an einer unüblichen Position liegt, geben Sie diese mit der Umgebungsvariable KERNELDIRS bekannt oder (alternativ) als Parameter der Option --kernel-dir beim Aufruf vom module-assistant.

source: Updating cached package data
de: Aktualisierung der zwischengespeicherten Daten...

source: Reading apt-cache output...
de: Lesen der Ausgaben von apt-cache...

source: Updating info about %s
de: Aktualisierung der Daten über %s

source: Updated infos about %s packages
de: Daten über %s Pakete aktualisiert.

source: Updated infos about %s package
de: Daten über %s Paket aktualisiert.

source: Kernel headers available in %s
de: Kernel-Header verfügbar in %s

source: Creating symlink...
de: Erstelle symbolischen Link...

source: Couldn't create the %s/linux symlink!
de: Der Symlink %s/linux konnte nicht erstellt werden!

source: Installing packages needed for the build environment...
de: Pakete für die Bau-Umgebung werden installiert...

source: Done!
de: Fertig!

source: %s, what is %s?
de: %s? Was ist %s?

source: Installation of the %s source failed.
de: Installation des Quellcodes von %s fehlgeschlagen.

source: Ignoring this package. Maybe you need to add something to sources.list, maybe the contrib and non-free archives.
de: Das Paket wird ignoriert. Möglicherweise muss etwas in die Datei sources.list einfgefügt werden, zum Beispiel contrib- und non-free-Archive.

source: $KPKG_DEST_DIR is not set and the target directory
de: $KPKG_DEST_DIR nicht gesetzt und das Zielverzeichnis

source: %s is not writeable for you! Your build will probably fail!
de: %s ist nicht für Sie beschreibbar! Der Bauvorgang wird höchstwahrscheinlich fehlschlagen!

source: Recently built package %s found, not rebuilding %s
de: Zuletzt gebautes Paket %s wurde gefunden, %s wird nicht neu gebaut.

source: Target package file %s already exists, not rebuilding!
de: Die zu erstellende Paket-Datei %s existiert bereits, wird nicht neugebaut!

source: Building %s, step %d, please wait...
de: %s wird gebaut, Schritt %d, bitte warten...

source: Build starting...
de: Bauvorgang wird gestartet...

source: Build continues...
de: Bauvorgang fortgesetzt...

source: Done! Run m-a install %s to install.
de: Fertig! Zum Installieren des Modul-Pakets m-a install %s ausführen.

source: module-assistant, interactive mode
de: module-assistant, interaktiver Modus

source: Build of the package %s failed! How do you wish to proceed?
de: Bau-Vorgang des Pakets %s fehlgeschlagen! Was ist der nächste Schritt?

source: Examine the build log file
de: Protokoll des Bauvorgangs untersuchen

source: Skip and continue with the next operation
de: Überspringen und mit der nächsten Operation weitermachen

source: Stop processing the build commands
de: Alle Bau-Operationen anhalten

source: Dialog command not working correctly!
de: Dialog-Kommand funktioniert nicht richtig!

source: module-assistant, log file viewer
de: module-assistant, Protokollbetrachter

source: Build failed! See %s for details!
de: Bauvorgang fehlgeschlagen! Weitere Details in %s!

source: Done with %s .
de: Fertig mit %s .

source: Build failed. Press Return to continue...
de: Bauvorgang fehlgeschlagen. Zum Weitermachen Return drücken...

source: Package %s was not built successfully, see %s for details!
de: Paket %s wurde nicht erfolgreich gebaut! Weitere Details in %s.

source: You maybe want to run "auto-install" instead of install.
de: Vielleicht sollte "auto-install" statt install verwendet werden.

source: Direct installation failed, trying to post-install the dependencies
de: Direkte Installation nicht möglich; es wird versucht, zusätzlich benötigte Pakete zu installieren.

source: Warning, the cache is empty. You maybe wish to run the command "module-assistant update" first!
de: Warnung, der Cache ist leer. Sie sollten zuerst das Kommando "module-assistant update" ausführen!

source: %s (source) available (not up-to-date, V: %s vs. %s)
de: %s (Quellcode) verfügbar (veraltet, V: %s vs. %s)

source: %s (source) installed (V: %s):
de: %s (Quellcode) installiert (V: %s):

source: %s (source package not installed):
de: %s (Quellcode-Paket nicht installiert):

source: not found, possible candidate(s) installable with %s:
de: nicht gefunden, mögliche Kandidate (installierbar mit %s):

source: package not found, but following is already installed:
de: Paket nicht gefunden, aber folgende sind bereits installiert:

source: not found
de: nicht gefunden

source: -- Binary package(s) for kernel(s):
de: -- Binäre(s) Paket(e) für Kernel:

source: Some packages could not be found. The "search" command can search in the package pool for precompiled packages.
de: Einige Pakete wurden nicht gefunden. Das Kommando "search" kann nach fertigen (vorkompilierten) Paketen im Pool suchen.

source: No data? You maybe want to run "module-assistant update" first.
de: Keine Daten? Sie sollten "module-assistant update" zuerst ausführen.

source: Experimental kernel source recreating method... Getting source...
de: Experimentelle Methode zur Rekonstruktion des Kernel-Quellcodes... Quellcode wird besorgt...

source: Config not found, getting headers to extract the config...
de: Konfiguration nicht gefunden, Headers werden besorgt, um die Konfiguration zu extrahieren...

source: Extracting pristine kernel source, please wait...
de: Frischer Kernel-Quellcode wird ausgepackt, bitte warten...

source: Installing to final location and configuring, please wait...
de: Installiere in die endgültige Position und konfiguriere, bitte warten...

source: Faked kernel source for the Kernel %s. Warning: the configuration may not match the running kernel.
de: Nachgebauter Kernel-Quellcode für den Kernel %s fertig. Warnung: die Konfiguration könnte dem laufenden Kernel nicht genau entsprechen.

source: Warning, %s seems to contain unconfigured kernel source (see manpage for details)!
de: Warnung, %s enthält scheinbar einen nicht fertig konfigurierten Kernel-Quellcode (s. Manpage für Details)!

source: Warning, %s does not contain a valid kernel source tree, skipping!
de: Warnung, %s enthält keinen gültigen Kernel-Quellcode, wird übersprungen!

source: Welcome to the dialog frontend of module-assistant. This user interface provides access to the few commands of this program.
de: Willkommen bei der Dialog-Oberfläche von module-assistant. Diese Benutzeroberfläche bietet den Zugang zu einigen Kommandos des Programms.

source: If you wish to learn more, choose the OVERVIEW option.
de: Um mehr zu erfahren, wählen Sie die Option OVERVIEW.

source: You should better run UPDATE once before you proceed.
de: Vor dem Beginn sollte die Funktion UPDATE einmal ausgeführt werden.

source: If you wish to look for existing module packages for your needs or wish to compile a new one from source, choose them in the SELECT dialog and continue with possible commands.
de: Wenn Sie die Auflistung der existierenden Modul-Pakete möchten oder neue aus dem Quellcode bauen möchten, wählen Sie die Funktion SELECT im Dialog und fahren weiter mit möglichen Befehlen fort.

source: Show all possible command line commands
de: Alle bekannten Kommandozeilen-Kommandos anzeigen

source: Update the cached package information
de: Interne Informationen über Pakete aktualisieren

source: Configure the system to compile modules
de: Das System zum Kompilieren einrichten

source: Select the module/source packages to work on
de: Zu berarbeitende Module/Quellcode auswählen

source: Exit the program
de: Das Programm verlassen

source: module-assistant, command overview
de: module-assistant, Befehlsübersicht

source: Press Return to continue...
de: Zum Weitermachen Return drücken...

source: module-assistant, package selection
de: module-assistant, Paketauswahl

source: Please select the interesting module (source) packages.
de: Wählen Sie die interessanten Module (Quellcode) aus.

source: Use Cursor keys to browse, Space to select and Return to continue.
de: Pfeiltasten zum Navigieren, Leerzeile wählt aus, Return zum weitermachen.

source: Cancel to return to the main menu.
de: Abbrechen um ins Hautmenü zurückzukehren.

source: You have selected the following packages:
de: Sie haben folgende Pakete ausgewählt:

source: Choose one of the following commands to proceed or Cancel to return to the selection menu.
de: Wählen Sie die Kommandos, die durchgeführt werden sollen, oder Cancel für die Rückkehr zum Hauptmenü.

source: List installed (binary) packages
de: Installierte (binäre) Pakete auflisten

source: List and search with apt-cache
de: Auflisten mit Suche mittels apt-cache

source: Get or update the source package
de: Quellcode-Pakete holen oder aktualisieren

source: Compiles module packages for the current kernel
de: Modul-Pakete kompilieren für den derzeitigen Kernel

source: Installs the packages for the current kernel
de: Pakete für den derzeitigen Kernel installieren

source: Returns to the module selection
de: Zurück zur Paket-Auswahl

source: module-assistant, present packages
de: module-assistant, vorhandene Pakete

source: module-assistant, source installation
de: module-assistant, Paketinstallation

source: The source package may not to be installed. Would you like to install or upgrade selected source packages now?
de: Das Quellcode-Paket wurde wohl nicht installiert. Möchten Sie dieausgewählten Pakete jetzt installieren/aktualisieren?

source: module-assistant, package installation
de: module-assistant, Paketinstallation

source: Would you like to install the created module package(s) now?
de: Sollen die gebauten Modul-Pakete jetzt installiert werden?

source: NOTE: You are not root but member of the src group. Mapping the base working directory to "%s".
de: HINWEIS: Sie sind nicht Root aber Mitglied der src-Gruppe. Das Arbeitsverzeichnis wird auf "%s" abgebildet.

source: You are member of the src group but the replacement directory %s could not be created or is not writeable.
de: HINWEIS: Sie sind Mitglied der src-Gruppe aber das Arbeitsverzeichnis %s konnte nicht erstellt werden oder ist nicht beschreibbar.

source: You are not root and no replacement directory (the -u option) is specified. Unable to continue.
de: Sie sind nicht Root und es wurde kein Ersatz-Verzeichnis angegeben (die Option -u). Weitermachen unmöglich.
